{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-Name",
    "2": "I-Name",
    "3": "B-Age",
    "4": "I-Age",
    "5": "B-Phone",
    "6": "I-Phone",
    "7": "B-Email",
    "8": "I-Email",
    "9": "B-Address",
    "10": "I-Address",
    "11": "B-HospitalID",
    "12": "I-HospitalID",
    "13": "B-Date",
    "14": "I-Date",
    "15": "B-DoctorName",
    "16": "I-DoctorName",
    "17": "B-Organization",
    "18": "I-Organization",
    "19": "B-Other",
    "20": "I-Other"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-Address": 9,
    "B-Age": 3,
    "B-Date": 13,
    "B-DoctorName": 15,
    "B-Email": 7,
    "B-HospitalID": 11,
    "B-Name": 1,
    "B-Organization": 17,
    "B-Other": 19,
    "B-Phone": 5,
    "I-Address": 10,
    "I-Age": 4,
    "I-Date": 14,
    "I-DoctorName": 16,
    "I-Email": 8,
    "I-HospitalID": 12,
    "I-Name": 2,
    "I-Organization": 18,
    "I-Other": 20,
    "I-Phone": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
